import random

"""
# Найдите недостающее число от 1 до 100 в заданном целочисленном массиве с 100 элементами, используя только один цикл от 1 до 100.
q = list(map(int, input().split()))
a = 0
for i in range(len(q)):
    a = q[i] + a
a = 5050 - a
print(a)

if q.count(i) > 1:
        if i not in a:
            a.append(i)
"""
